===
document: single-line
===

/// test

---

(document
  (markdown_description))

===
document: multi-line
===

/**
 * test
 */

---

(document
  (description))

===
document: multi-line in disguise
===

/** test */

---

(document
  (description))

===
document: two lines
===

/**
 * test
 * this
 */

---

(document
  (description))

===
document: multi-line in disguise w/ block tag
===

/** test
 * @deprecated problem */

---

(document
  (description)
  (deprecated_tag
    (tag_name)
    (description)))
