===
see tag: member + label
===

/**
 * @see #member label
 */

---

(document
  (see_tag
    (tag_name)
    (reference
      (member
        (identifier)))
    (description)))

===
see tag: member
===

/**
 * @see #member
 */

---

(document
  (see_tag
    (tag_name)
    (reference
      (member
        (identifier)))))

===
see tag: member + label: without hash
===

/**
 * @see member label
 */

---

(document
  (see_tag
    (tag_name)
    (reference
      (member
        (identifier)))
    (description)))

===
see tag: member: without hash
===

/**
 * @see member
 */

---

(document
  (see_tag
    (tag_name)
    (reference
      (member
        (identifier)))))
